In [1]:
import pandas as pd
import numpy as np

In [4]:
data={'state':['ohio','ohio','ohio','nevada','nevada','navida'],'year':[2000,2001,2002,2001,2002,2003],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  navida  2003  3.2

In [6]:
frame.head()

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9

In [7]:
pd.DataFrame(data, columns=['year','state','pop'])

ValueError: All arrays must be of the same length

In [8]:
data={'state':['ohio','ohio','ohio','nevada','nevada','navida'],'year':[2000,2001,2002,2001,2002,2003],
     'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame=pd.DataFrame(data)
frame

    state  year  pop
0    ohio  2000  1.5
1    ohio  2001  1.7
2    ohio  2002  3.6
3  nevada  2001  2.4
4  nevada  2002  2.9
5  navida  2003  3.2

In [9]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9
5  2003  navida  3.2

In [12]:
frame2=pd.DataFrame(data, columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN
six    2003  navida  3.2  NaN

In [13]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [14]:
frame2['state']

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      navida
Name: state, dtype: object

In [15]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [16]:
frame2.loc['three']

year     2002
state    ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [17]:

frame2['debt']=16.5
frame2

       year   state  pop  debt
one    2000    ohio  1.5  16.5
two    2001    ohio  1.7  16.5
three  2002    ohio  3.6  16.5
four   2001  nevada  2.4  16.5
five   2002  nevada  2.9  16.5
six    2003  navida  3.2  16.5

In [18]:
frame2['debt']=np.arange(6.)
frame2

       year   state  pop  debt
one    2000    ohio  1.5   0.0
two    2001    ohio  1.7   1.0
three  2002    ohio  3.6   2.0
four   2001  nevada  2.4   3.0
five   2002  nevada  2.9   4.0
six    2003  navida  3.2   5.0

In [19]:
val=pd.Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    ohio  1.5   NaN
two    2001    ohio  1.7  -1.2
three  2002    ohio  3.6   NaN
four   2001  nevada  2.4  -1.5
five   2002  nevada  2.9  -1.7
six    2003  navida  3.2   NaN

In [20]:
frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    ohio  1.5   NaN    False
two    2001    ohio  1.7  -1.2    False
three  2002    ohio  3.6   NaN    False
four   2001  nevada  2.4  -1.5    False
five   2002  nevada  2.9  -1.7    False
six    2003  navida  3.2   NaN    False

In [21]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [22]:
pop={'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2002:1.7,2002:3.6}}
frame3=pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   NaN
2002     2.9   3.6
2000     NaN   1.5

In [23]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     NaN   3.6   1.5

In [24]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   NaN
2002     2.9   3.6
2003     NaN   NaN

In [25]:
frame3.index.name='year';frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2001      2.4   NaN
2002      2.9   3.6
2000      NaN   1.5

In [26]:
frame3.values

array([[2.4, nan],
       [2.9, 3.6],
       [nan, 1.5]])

In [27]:

frame2.values

array([[2000, 'ohio', 1.5, nan],
       [2001, 'ohio', 1.7, -1.2],
       [2002, 'ohio', 3.6, nan],
       [2001, 'nevada', 2.4, -1.5],
       [2002, 'nevada', 2.9, -1.7],
       [2003, 'navida', 3.2, nan]], dtype=object)